<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"a10eb4afffe9665d62757f0f59a25c6e79d31dcf681240af627cc6668b7a4511","plan_job_ref":"Job Environment Main - Plan #435 at https://github.com/jarrod-lowe/wildsea/actions/runs/11422420573","plan_out_hash":"cd2db978638abb031ab40c9314a2c486a00c77284716d290c5b6635a026d57c5","plan_hash":"d0cf9b474c973ddc493f36084db48645e0e832d83a9549e03167d20ca464e10f","plan_text_format":"diff","version":"1.44.0"} -->
Terraform plan in __terraform/environment/wildsea__
With backend config: `bucket=terraform-state-021891603679 key=primary/terraform.tfstate region=ap-southeast-2`<details open><summary>With variables</summary>

```hcl
domain_name          = "wildsea.lowe.kiwi"
environment          = "primary"
google_client_id     = (sensitive value)
google_client_secret = (sensitive value)
saml_metadata_url    = (sensitive value)
```
</details>
<details>
<summary>Plan: 1 to add, 3 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.wildsea.data.aws_iam_policy_document.deleter_bus will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "deleter_bus" {
+       id            = (known after apply)
+       json          = (known after apply)
+       minified_json = (known after apply)

+       statement {
+           actions   = [
+               "appsync:GraphQL",
            ]
+           resources = [
+               "arn:aws:appsync:ap-southeast-2:021891603679:apis/tfiz6mnf2nhyzpzkwm554sir5q/types/Mutation/fields/deletePlayer",
            ]
+           sid       = "InvokeGraphQL"
        }
    }

  # module.wildsea.aws_appsync_graphql_api.graphql will be updated in-place
!~  resource "aws_appsync_graphql_api" "graphql" {
        id                            = "tfiz6mnf2nhyzpzkwm554sir5q"
        name                          = "Wildsea-primary"
!~      schema                        = <<-EOT
            scalar AWSTime
            scalar AWSDateTime
            scalar AWSTimestamp
            scalar AWSEmail
            scalar AWSJSON
            scalar AWSURL
            scalar AWSPhone
            scalar AWSIPAddress
            
            directive @aws_subscribe(mutations: [String!]!) on FIELD_DEFINITION
            directive @aws_auth(cognito_groups: [String!]!) on FIELD_DEFINITION
            directive @aws_api_key on FIELD_DEFINITION | OBJECT
            directive @aws_iam on FIELD_DEFINITION | OBJECT
            directive @aws_oidc on FIELD_DEFINITION | OBJECT
            directive @aws_cognito_user_pools(
              cognito_groups: [String!]
            ) on FIELD_DEFINITION | OBJECT
            
            type Mutation {
          -     createGame(input: CreateGameInput!): GameSummary! @aws_cognito_user_pools
          +     createGame(input: CreateGameInput!): GameSummary! @aws_cognito_user_pools(cognito_groups: ["CreateGame"])
                joinGame(input: JoinGameInput!): PlayerSheetSummary! @aws_cognito_user_pools
                updateGame(input: UpdateGameInput!): GameSummary! @aws_cognito_user_pools
                deleteGame(input: DeleteGameInput!): GameSummary! @aws_cognito_user_pools
                createSection(input: CreateSectionInput!): SheetSection! @aws_cognito_user_pools
                updateSection(input: UpdateSectionInput!): SheetSection! @aws_cognito_user_pools
                deleteSection(input: DeleteSectionInput!): SheetSection! @aws_cognito_user_pools
                updatePlayer(input: UpdatePlayerInput!): PlayerSheetSummary @aws_cognito_user_pools
                deletePlayer(input: DeletePlayerInput!): PlayerSheetSummary @aws_cognito_user_pools @aws_iam
                createShip(input: CreateShipInput!): PlayerSheetSummary! @aws_cognito_user_pools
            }
            
            type Query {
                getGame(input: GetGameInput): Game! @aws_cognito_user_pools
                getGames: [PlayerSheetSummary!] @aws_cognito_user_pools
            }
            
            type Subscription @aws_cognito_user_pools {
              updatedPlayer(gameId: ID!): PlayerSheetSummary @aws_subscribe(mutations: ["updatePlayer", "deletePlayer", "createShip", "joinGame"])
              updatedSection(gameId: ID!): SheetSection @aws_subscribe(mutations: ["createSection", "updateSection", "deleteSection"])
              updatedGame(gameId: ID!): GameSummary @aws_subscribe(mutations: ["updateGame", "deleteGame"])
            }
            
            input GetGameInput {
              gameId: ID!
            }
            
            input CreateGameInput {
                name: String!
                description: String
            }
            
            input JoinGameInput {
              gameId: ID!
              joinToken: ID!
            }
            
            input DeleteGameInput {
              gameId: ID!
            }
            
            input UpdateGameInput {
              gameId: ID!
              name: String!
              description: String
            }
            
            input DeletePlayerInput {
              gameId: ID!
              userId: ID!
            }
            
            input CreateSectionInput {
              userId: ID
              gameId: ID!
              sectionName: String!
              sectionType: String!
              content: AWSJSON
              position: Int!
            }
            
            input UpdateSectionInput {
              gameId: ID!
              sectionId: ID!
              sectionName: String
              content: AWSJSON
              position: Int
            }
            
            input DeleteSectionInput {
              gameId: ID!
              sectionId: ID!
            }
            
            type GameSummary @aws_cognito_user_pools {
              gameId: ID!
              gameName: String!
              gameDescription: String
              fireflyUserId: String!
              createdAt: AWSDateTime!
              updatedAt: AWSDateTime!
              type: String!
              deleted: Boolean
            }
            
            type Game @aws_cognito_user_pools {
              gameId: ID!
              gameName: String!
              gameDescription: String
              playerSheets: [PlayerSheet!]!
              joinToken: String
              fireflyUserId: String!
              createdAt: AWSDateTime!
              updatedAt: AWSDateTime!
              type: String!
              deleted: Boolean
            }
            
            input UpdatePlayerInput {
              gameId: ID!
              userId: ID!
              characterName: String!
            }
            
            input CreateShipInput {
              gameId: ID!
              characterName: String!
            }
            
            type PlayerSheetSummary @aws_cognito_user_pools @aws_iam {
              userId: ID!
              gameId: ID!
              gameName: String!
              gameDescription: String!
              characterName: String!
              type: String!
              createdAt: AWSDateTime!
              updatedAt: AWSDateTime!
              deleted: Boolean
            }
            
            type PlayerSheet @aws_cognito_user_pools {
              userId: ID!
              gameId: ID!
              characterName: String!
              sections: [SheetSection!]!
              type: String!
              createdAt: AWSDateTime!
              updatedAt: AWSDateTime!
              fireflyUserId: ID!
            }
            
            type SheetSection @aws_cognito_user_pools {
              userId: ID!
              gameId: ID!
              sectionId: ID!
              type: String!
              sectionName: String!
              sectionType: String!
              content: AWSJSON!
              position: Int!
              createdAt: AWSDateTime!
              updatedAt: AWSDateTime!
              deleted: Boolean
            }
        EOT
        tags                          = {
            "Name" = "Wildsea-primary"
        }
#        (11 unchanged attributes hidden)

#        (2 unchanged blocks hidden)
    }

  # module.wildsea.aws_cognito_identity_provider.google-oauth[0] will be updated in-place
!~  resource "aws_cognito_identity_provider" "google-oauth" {
        id                = "ap-southeast-2_mi8U4SiYJ:Google"
!~      provider_details  = {
-           "attributes_url"                = "https://people.googleapis.com/v1/people/me?personFields=" -> null
-           "attributes_url_add_attributes" = "true" -> null
-           "authorize_url"                 = "https://accounts.google.com/o/oauth2/v2/auth" -> null
-           "oidc_issuer"                   = "https://accounts.google.com" -> null
-           "token_request_method"          = "POST" -> null
-           "token_url"                     = "https://www.googleapis.com/oauth2/v4/token" -> null
#            (3 unchanged elements hidden)
        }
#        (5 unchanged attributes hidden)
    }

  # module.wildsea.aws_cognito_user_group.group_CreateGame will be created
+   resource "aws_cognito_user_group" "group_CreateGame" {
+       description  = "Users who may create new games"
+       id           = (known after apply)
+       name         = "CreateGame"
+       user_pool_id = "************************"
    }

  # module.wildsea.aws_iam_policy.deleter_bus will be updated in-place
!~  resource "aws_iam_policy" "deleter_bus" {
        id               = "arn:aws:iam::021891603679:policy/Wildsea-primary-deleter-bus"
        name             = "Wildsea-primary-deleter-bus"
!~      policy           = jsonencode(
            {
-               Statement = [
-                   {
-                       Action   = "appsync:GraphQL"
-                       Effect   = "Allow"
-                       Resource = "arn:aws:appsync:ap-southeast-2:021891603679:apis/tfiz6mnf2nhyzpzkwm554sir5q/types/Mutation/fields/deletePlayer"
-                       Sid      = "InvokeGraphQL"
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {}
#        (7 unchanged attributes hidden)
    }

Plan: 1 to add, 3 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Environment Main - Plan #435](https://github.com/jarrod-lowe/wildsea/actions/runs/11422420573)